app/Controllers/Home.php

    protected function getData()
    {
        $countryModel = new \App\Models\Countries_model();
        $currentCountry = $countryModel->where('name', $this->countryName)->first();

        $allCountrydb = $countryModel->findAll();
---
SELECT *
FROM `countries`
WHERE `name` = 'afghanistan'
 LIMIT 1
SELECT *
FROM `countries`