app/Models/countries_model.php

    public function get_countries()
    {
        return $this->findAll();
---
SELECT *
FROM `countries`